app/controllers/posts_controller.rb

    def show
        post = Post.find_by_id(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        post = Post.create(position: params[:position], company: params[:company], location: params[:location], length: params[:length], jobLink: params[:jobLink], instagram: params[:instagram], facebook: params[:facebook], description: params[:description], accepted: false)
---
INSERT INTO "posts" ("position", "company", "location", "length", "jobLink", "instagram", "facebook", "description", "accepted", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

    def update
        post = Post.find(params[:id])
        post.update(
            # position: params[:position],
            # company: params[:company],
            # location: params[:location],
            # length: params[:length],
            # jobLink: params[:jobLink],
            # instagram: params[:instagram],
            # facebook: params[:facebook],
            # description: params[:description],
            accepted: params[:accepted]
        )
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "posts" SET "accepted" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["accepted", 1], ["updated_at", "2020-06-10 14:01:42.418854"], ["id", 6]]

    def destroy
        post = Post.find_by_id(params[:id])
        post.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 3]]