app/controllers/post_images_controller.rb

SELECT "post_images".* FROM "post_images" WHERE "post_images"."post_id" = ?  [["post_id", 1]]
---
    def index
        postImages = PostImage.all

SELECT "post_images".* FROM "post_images" WHERE "post_images"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        post_image = PostImage.find_by_id(params[:id])